{
    "letter2id": {
        "<pad>": 0,
        "<sos>": 1,
        "<unk>": 2,
        "+": 3,
        "а": 4,
        "б": 5,
        "в": 6,
        "г": 7,
        "д": 8,
        "е": 9,
        "ж": 10,
        "з": 11,
        "и": 12,
        "й": 13,
        "к": 14,
        "л": 15,
        "м": 16,
        "н": 17,
        "о": 18,
        "п": 19,
        "р": 20,
        "с": 21,
        "т": 22,
        "у": 23,
        "ф": 24,
        "х": 25,
        "ц": 26,
        "ч": 27,
        "ш": 28,
        "щ": 29,
        "ъ": 30,
        "ы": 31,
        "ь": 32,
        "э": 33,
        "ю": 34,
        "я": 35,
        "ё": 36,
        "<eos>": 37
    },
    "ph2id": {
        "<pad>": 0,
        "<sos>": 1,
        "<unk>": 2,
        "a": 3,
        "b": 4,
        "bʲ": 5,
        "d": 6,
        "dʲ": 7,
        "f": 8,
        "fʲ": 9,
        "g": 10,
        "gʲ": 11,
        "i": 12,
        "j": 13,
        "k": 14,
        "kʲ": 15,
        "l": 16,
        "lʲ": 17,
        "m": 18,
        "mʲ": 19,
        "n": 20,
        "nʲ": 21,
        "p": 22,
        "pʲ": 23,
        "r": 24,
        "rʲ": 25,
        "s": 26,
        "sʲ": 27,
        "t": 28,
        "tʲ": 29,
        "t͡s": 30,
        "t͡ɕ": 31,
        "u": 32,
        "v": 33,
        "vʲ": 34,
        "x": 35,
        "xʲ": 36,
        "z": 37,
        "zʲ": 38,
        "ɔ": 39,
        "ɕː": 40,
        "ə": 41,
        "ɛ": 42,
        "ɨ": 43,
        "ɪ": 44,
        "ʂ": 45,
        "ʌ": 46,
        "ʐ": 47,
        "ˈ": 48,
        "<eos>": 49
    },
    "id2ph": {
        "0": "<pad>",
        "1": "<sos>",
        "2": "<unk>",
        "3": "a",
        "4": "b",
        "5": "bʲ",
        "6": "d",
        "7": "dʲ",
        "8": "f",
        "9": "fʲ",
        "10": "g",
        "11": "gʲ",
        "12": "i",
        "13": "j",
        "14": "k",
        "15": "kʲ",
        "16": "l",
        "17": "lʲ",
        "18": "m",
        "19": "mʲ",
        "20": "n",
        "21": "nʲ",
        "22": "p",
        "23": "pʲ",
        "24": "r",
        "25": "rʲ",
        "26": "s",
        "27": "sʲ",
        "28": "t",
        "29": "tʲ",
        "30": "t͡s",
        "31": "t͡ɕ",
        "32": "u",
        "33": "v",
        "34": "vʲ",
        "35": "x",
        "36": "xʲ",
        "37": "z",
        "38": "zʲ",
        "39": "ɔ",
        "40": "ɕː",
        "41": "ə",
        "42": "ɛ",
        "43": "ɨ",
        "44": "ɪ",
        "45": "ʂ",
        "46": "ʌ",
        "47": "ʐ",
        "48": "ˈ",
        "49": "<eos>"
    }
}
